tap "adoptopenjdk/openjdk"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"

cask_args appdir: "/Applications"

brew "ack"
brew "applesimutils"
brew "binutils"
brew "ccat"
brew "chruby"
brew "cocoapods"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "jq"
brew "jupyterlab"
brew "mas"
brew "moreutils"
brew "neovim"
brew "node"
brew "python"
brew "pyenv"
brew "rename"
brew "rsync"
brew "ruby-install"
brew "rust"
brew "screen"
brew "starship"
brew "stow"
brew "swiftlint"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zplug"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "1password"
cask "adoptopenjdk11"
cask "adoptopenjdk11-jre"
cask "airpass"
cask "alacritty"
cask "alfred"
cask "android-studio"
cask "dozer"
cask "expo-orbit"
cask "firefox"
cask "flux"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "intellij-idea-ce"
cask "istat-menus"
cask "kap"
cask "kicad"
cask "lulu"
cask "miniconda"
cask "postman"
cask "prusaslicer"
cask "sketch"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "zoom"

# install gradle here, since by now the jdk is installed
brew "gradle"

# initialize yabai and skhd
yabai --install-service
yabai --start-service
skhd --install-service
skhd --start-service